// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

const max = 30;
let num = '';
for (let i = 20; i <=30; i += 0.5) {
    num += i;
    if (i !== max) {
        num += ' '
    }   
}
console.log(`Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 : ${num}`)

// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

const max2 = 100;
const doll = 27;
let trans = '';
for (let i = 10; i <=max2; i += 10) {
    trans += `${i} доларів = ${i * doll} гривень`;
    if (i !== max2) {
        trans += ', '
    }
}
console.log(`Один долар коштує 27 гривень: ${trans}`)

// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

const N = +prompt('enter number');
const max3 = 100;
let square = '';
for (let i = 1; i <= max3; i++) {
    if (i * i <= N) {
        square += `${i}, `;
    }
    
}
console.log(`Дане ціле число ${N}. Всі цілі числа від 1 до 100, квадрат яких не перевищує ${N} : ${square}`)

// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let num2 = false;
    if (N === 1 || N <=0) {
        console.log('введіть число більше 2')
    } else if (N > 1) {
        for (let i = 2; i < N / 2; i++) {
            if (N % i == 0) {
                num2 = true;
                break;
            } 
        }
        if (num2 == true) {
            console.log(`${N} - непросте число`)
        } else {
            console.log(`${N} - просте число`)
        }
    } else {
        console.log(`${N} - непросте число`)
    }

// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let num3 = false;
for (let i = 0; i <= N; i++) {
    if (N == 3 ** i) {
        num3 = true;
        break;
    }
    
}
if (num3 == true) {
    console.log(`Число ${N} можна отримати шляхом зведення 3 в деякий ступінь `)
} else {
    console.log(`Число ${N} не можна отримати шляхом зведення 3 в деякий ступінь `)
}